[property]
description=common actions.
default_action=append
'継承するアクション（空白区切り）
base_kind=

'アクション(action.より右側の文字（nop）はメニュー表示で使用する名前)
[action.nop]
'秀丸マクロのラベル名
function=nop
'アクションの説明
description=Do nothing.
is_multi_selectable=true

[action.yank]
function=yank
description=Yank the candidate "word" or "action__text".
is_multi_selectable=true

[action.yank_escape]
function=yank_escape
description=Yank the escaped candidate "word" or "action__text".

[action.insert]
function=insert
is_edit=true
description=Insert the candidate word or text before the cursor.

[action.overwrite]
function=overwrite
is_edit=true
description=Owerwrite the candidate word or text before the cursor.

[action.preview]
function=preview
description=Preview the candidate text.

[action.echo]
function=echo
description=Echo candidates for debug.
